reports/static.txt
Running 30s test @ http://localhost:8000/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms    1.37ms  27.86ms   87.24%
    Req/Sec    32.22k     3.41k   47.05k    71.23%
  9619718 requests in 30.02s, 1.33GB read
Requests/sec: 320492.35
Transfer/sec:     45.24MB